[
    {
        "bookId": 1,
        "bookName": "1984",
        "author": "George Orwell",
        "image": "https://i.ibb.co/rFGfbFK/download.jpg",
        "review": "1984 by George Orwell is a chilling portrayal of a dystopian society where totalitarianism reigns supreme. Set in a future world where the government monitors every aspect of its citizens' lives, the novel follows the story of Winston Smith, a disillusioned member of the Outer Party who rebels against the oppressive regime. Through Winston's eyes, readers witness the horrors of thought control, surveillance, and propaganda.",
        "totalPages": 328,
        "rating": 4.5,
        "category": "Fiction",
        "tags": [
            "Dystopian",
            "Political"
        ],
        "publisher": "Harvill Secker",
        "yearOfPublishing": 1949
    },
    {
        "bookId": 2,
        "bookName": "To Kill a Mockingbird",
        "author": "Harper Lee",
        "image": "https://i.ibb.co/V3bckb8/download-1.jpg",
        "review": "To Kill a Mockingbird by Harper Lee is a timeless classic that addresses profound issues of racial injustice and moral growth. Set in the racially charged atmosphere of the American South during the 1930s, the novel follows the story of Scout Finch, a young girl coming of age in a town plagued by prejudice and bigotry. Through Scout's innocent perspective, Lee explores themes of empathy, compassion, and the importance of standing up for what is right, even in the face of adversity.",
        "totalPages": 336,
        "rating": 4.8,
        "category": "Fiction",
        "tags": [
            "Coming-of-age",
            "Legal drama"
        ],
        "publisher": "J. B. Lippincott & Co.",
        "yearOfPublishing": 1960
    },
    {
        "bookId": 3,
        "bookName": "The Great Gatsby",
        "author": "F. Scott Fitzgerald",
        "image": "https://i.ibb.co/BZ7HBcG/download-2.jpg",
        "review": "The Great Gatsby by F. Scott Fitzgerald is a mesmerizing tale of love, wealth, and the elusive American Dream. Set amidst the glitz and glamour of the roaring twenties, the novel follows the enigmatic Jay Gatsby and his obsession with the beautiful Daisy Buchanan. Through Gatsby's pursuit of wealth and status, Fitzgerald paints a vivid portrait of the Jazz Age, where excess and decadence mask deeper insecurities and desires.",
        "totalPages": 180,
        "rating": 4.2,
        "category": "Fiction",
        "tags": [
            "Romance",
            "Jazz Age"
        ],
        "publisher": "Charles Scribner's Sons",
        "yearOfPublishing": 1925
    },
    {
        "bookId": 4,
        "bookName": "The Catcher in the Rye",
        "author": "J.D. Salinger",
        "image": "https://i.ibb.co/b62CYMm/download-3.jpg",
        "review": "The Catcher in the Rye by J.D. Salinger is an iconic coming-of-age novel that captures the disillusionment of youth in a post-war society. Narrated by the rebellious teenager Holden Caulfield, the novel follows his journey through New York City as he grapples with issues of identity, belonging, and alienation. Salinger's portrayal of Holden's angst and vulnerability resonates with readers who have experienced the confusion and uncertainty of adolescence.",
        "totalPages": 224,
        "rating": 4.1,
        "category": "Fiction",
        "tags": [
            "Young Adult",
            "Existentialism"
        ],
        "publisher": "Little, Brown and Company",
        "yearOfPublishing": 1951
    },
    {
        "bookId": 5,
        "bookName": "The Hobbit",
        "author": "J.R.R. Tolkien",
        "image": "https://i.ibb.co/TMks54d/download-4.jpg",
        "review": "The Hobbit by J.R.R. Tolkien is a charming adventure through Middle-earth that captivates readers of all ages. The story follows the journey of Bilbo Baggins, a hobbit who is swept away on an unexpected quest to reclaim the lost kingdom of Erebor from the fearsome dragon Smaug. Along the way, Bilbo encounters trolls, elves, and goblins, forming unlikely friendships and facing countless dangers.",
        "totalPages": 310,
        "rating": 4.7,
        "category": "Fantasy",
        "tags": [
            "Adventure",
            "Quest"
        ],
        "publisher": "George Allen & Unwin",
        "yearOfPublishing": 1937
    },
    {
        "bookId": 6,
        "bookName": "Pride and Prejudice",
        "author": "Jane Austen",
        "image": "https://i.ibb.co/PDw83Yd/download-5.jpg",
        "review": "Pride and Prejudice by Jane Austen is a delightful comedy of manners that explores themes of love, marriage, and societal expectations in Georgian England. The novel follows the spirited Elizabeth Bennet as she navigates the complexities of society and the pitfalls of romance. Along the way, she encounters the enigmatic Mr. Darcy, whose pride and prejudice initially stand in the way of their happiness.",
        "totalPages": 432,
        "rating": 4.6,
        "category": "Classic",
        "tags": [
            "Romance",
            "Satire"
        ],
        "publisher": "T. Egerton, Whitehall",
        "yearOfPublishing": 1813
    }
]